In [6]:
import pandas as pd
pd.set_option('display.max_columns', None)

In [10]:
sb_70_75 = pd.read_csv('1970-75.csv')
df = pd.DataFrame()

sb = sb_70_75.SB

df.insert(0, 'SB', sb)
df.SB = df.SB.sum()
df = df.drop(df.index.to_list()[1:], axis = 0)

sb_70_75 = df
sb_70_75.head()

      SB
0  12532

In [11]:
sb_76_80 = pd.read_csv('1976-80.csv')
df = pd.DataFrame()

sb = sb_76_80.SB

df.insert(0, 'SB', sb)
df.SB = df.SB.sum()
df = df.drop(df.index.to_list()[1:], axis = 0)

sb_76_80 = df
sb_76_80.head()

      SB
0  15350

In [12]:
sb_81_85 = pd.read_csv('1981-85.csv')
df = pd.DataFrame()

sb = sb_81_85.SB

df.insert(0, 'SB', sb)
df.SB = df.SB.sum()
df = df.drop(df.index.to_list()[1:], axis = 0)

sb_81_85 = df
sb_81_85.head()

      SB
0  14651

In [13]:
sb_86_90 = pd.read_csv('1986-90.csv')
df = pd.DataFrame()

sb = sb_76_80.SB

df.insert(0, 'SB', sb)
df.SB = df.SB.sum()
df = df.drop(df.index.to_list()[1:], axis = 0)

sb_86_90 = df
sb_86_90.head()

      SB
0  15350

In [14]:
sb_91_95 = pd.read_csv('1991-95.csv')
df = pd.DataFrame()

sb = sb_91_95.SB

df.insert(0, 'SB', sb)
df.SB = df.SB.sum()
df = df.drop(df.index.to_list()[1:], axis = 0)

sb_91_95 = df
sb_91_95.head()

      SB
0  14837

In [15]:
sb_96_00 = pd.read_csv('1996-00.csv')
df = pd.DataFrame()

sb = sb_96_00.SB

df.insert(0, 'SB', sb)
df.SB = df.SB.sum()
df = df.drop(df.index.to_list()[1:], axis = 0)

sb_96_00 = df
sb_96_00.head()

      SB
0  16177

In [16]:
sb_01_05 = pd.read_csv('2001-05.csv')
df = pd.DataFrame()

sb = sb_01_05.SB

df.insert(0, 'SB', sb)
df.SB = df.SB.sum()
df = df.drop(df.index.to_list()[1:], axis = 0)

sb_01_05 = df
sb_01_05.head()

      SB
0  13580

In [17]:
sb_06_10 = pd.read_csv('2006-10.csv')
df = pd.DataFrame()

sb = sb_06_10.SB

df.insert(0, 'SB', sb)
df.SB = df.SB.sum()
df = df.drop(df.index.to_list()[1:], axis = 0)

sb_06_10 = df
sb_06_10.head()

      SB
0  14413

In [18]:
sb_11_15 = pd.read_csv('2011-15.csv')
df = pd.DataFrame()

sb = sb_11_15.SB

df.insert(0, 'SB', sb)
df.SB = df.SB.sum()
df = df.drop(df.index.to_list()[1:], axis = 0)

sb_11_15 = df
sb_11_15.head()

      SB
0  14470

In [19]:
sb_16_21 = pd.read_csv('2016-21.csv')
df = pd.DataFrame()

sb = sb_16_21.SB

df.insert(0, 'SB', sb)
df.SB = df.SB.sum()
df = df.drop(df.index.to_list()[1:], axis = 0)

sb_16_21 = df
sb_16_21.head()

      SB
0  12916

In [20]:
sb_data = pd.concat([sb_70_75, sb_76_80, sb_81_85, sb_86_90, sb_91_95, sb_96_00, sb_01_05, sb_06_10, sb_11_15, sb_16_21])

In [21]:
len(sb_data)

10

In [22]:
test_sb_data = sb_data

In [23]:
test_sb_data

      SB
0  12532
0  15350
0  14651
0  15350
0  14837
0  16177
0  13580
0  14413
0  14470
0  12916

In [24]:
years = ['1970-1975', '1976-1980', '1981-1985', '1986-1990', '1991-1995', '1996-2000', '2001-2005', '2006-2010', '2011-2015', '2016-2021']

In [25]:
test_sb_data.insert(0, 'Years', years)

In [26]:
test_sb_data

       Years     SB
0  1970-1975  12532
0  1976-1980  15350
0  1981-1985  14651
0  1986-1990  15350
0  1991-1995  14837
0  1996-2000  16177
0  2001-2005  13580
0  2006-2010  14413
0  2011-2015  14470
0  2016-2021  12916

In [27]:
test_sb_data.set_index('Years')

              SB
Years
1970-1975  12532
1976-1980  15350
1981-1985  14651
1986-1990  15350
1991-1995  14837
1996-2000  16177
2001-2005  13580
2006-2010  14413
2011-2015  14470
2016-2021  12916

In [28]:
test_sb_data = test_sb_data.reset_index(drop=True)

In [29]:
test_sb_data

       Years     SB
0  1970-1975  12532
1  1976-1980  15350
2  1981-1985  14651
3  1986-1990  15350
4  1991-1995  14837
5  1996-2000  16177
6  2001-2005  13580
7  2006-2010  14413
8  2011-2015  14470
9  2016-2021  12916

In [30]:
test_sb_data.set_index('Years', inplace=True)

In [31]:
test_sb_data

              SB
Years
1970-1975  12532
1976-1980  15350
1981-1985  14651
1986-1990  15350
1991-1995  14837
1996-2000  16177
2001-2005  13580
2006-2010  14413
2011-2015  14470
2016-2021  12916

In [32]:
sb_data = test_sb_data

In [33]:
sb_data

              SB
Years
1970-1975  12532
1976-1980  15350
1981-1985  14651
1986-1990  15350
1991-1995  14837
1996-2000  16177
2001-2005  13580
2006-2010  14413
2011-2015  14470
2016-2021  12916

In [34]:
sb_data.to_csv('sb_data.csv')